
'''

Легкий рівень

'''

# 1. Знайдіть суму квадратів елементів цього словника.
# dct = { 'x': '1', 'y': '2', 'z': '3' }

# 2. Складіть значення кожного словника. Потім від першої суми відніміть другу.
# dct1 = { '1': 12, '2': 24, '3': 36 }
# dct2 = { 'a': '3', 'b': '6', 'c': '9' }

# 3. Перетворіть усі його значення на рядки.
# dct = { 1: '4', 2: '5', 3: '6' }

# 4. Напишіть код, щоб отримати наступний результат:
# Код:
# dct = { 'x': '1', 'y': '2', 'z': '3' }
# Вихідний код:
# ['11', '222', '3333']

# 5. Напишіть код, щоб отримати наступний результат:Напишіть код, щоб отримати наступний результат:
# Код:
# dct = { 'x': '1', 'y': '2', 'z': '3' }
# Вихідний код:
# ['x', 'yy', 'zzz']

# 6. Складіть елементи цього словника як рядки:
# Код:
# dct = { 'x': 1, 'y': 2, 'z': 3 }
# Вихідний код:
# '123'

# 7. Складіть елементи цього словника як рядки:
# Код:
# dct = { 'a': 7, 'b': 6, 'c': 5 }
# Вихідний код:
# '5/6/7'

# 8. Складіть елементи цього словника у вигляді наступної дати:
# Код:
# dct = { 'y': 2025, 'm': 12, 'd': 31 }
# Вихідний код:
# '2025-12-31'

# 9. Дано словник, який містить «Прізвище»-«оцінка». На його основі створити новий словник,
# який буде містити лише учнів, які навчаються на 4 та 5
# students = {"Петров": 3, "Іванов": 4, "Сидоров": 5, "Смирнов": 2, "Козлов": 4}

# 10. Погода. У словнику збережено інформацію про температурі у різних містах: ключами є назви
# міст, значеннями – температура. Розрахуйте середню температуру за цими містами
# temperatures = {
#     'Київ': 25,
#     'Львів': 20,
#     'Одеса': 28,
#     'Харків': 22,
#     'Дніпро': 24
# }

# 11.Користувач має логін та пароль. Користувач має ввести свій логін та пароль, перевірити дані і
# написати чи вхід здійснено чи н.і
# users = {
#     'john': 'password123',
#     'alice': 'alice2022',
#     'bob': 'bobiscool',
#     'emma': 'emma1234',
#     'david': 'davidPassword'
# }

'''

Складний рівень

'''

# 1. Напишіть програму, яка приймає два словники і повертає словник з ключами як з першого
# словника, так і з другого словника, а значення якого складаються з значень обох словників.
