'''

Легкий рівень

'''

# 1. Нехай у вас є змінні, які приймають ім'я та прізвище студента, номер його курсу. Створіть
# функцію, яка виведе значення цих змінних на екран. При цьому нехай прізвище виводиться у
# верхньому регістрі, а ім'я - тільки перша буква.
#
# Вхідні дані:
# Shelder
# Tomas
# 5
#
# Вихідні дані:
# SHELDER
# T
# 5

# 2. Зробіть функцію, яка виводитиме площу прямокутника.

# 3. Зробіть функцію, яка параметром прийматиме рядок і повертатиме кортеж її символів.

# 4. Створіть функцію, яка перевірятиме два числа. Нехай вона виводить повідомлення про те, яке з
# них більше за інше або якщо вони рівні один одному за значенням.

# 5. Зробіть функцію, яка перевірятиме тип змінної і якщо вона є числом, то перетворить її на рядок.

# 6. Зробіть функцію, що заповнює список парними числами 1 від заданого.

# 7. Нехай у вас є словник, в якому як ключі зберігаються імена користувачів, а як значення - їх
# вік. Створіть функцію, яка виведе всі пари ключ-значення у вигляді кортежу.

# 8. Зробіть функцію, яка параметром прийматиме число, а повертатиме рядок з відповідним днем ​​тижня.

# 9. Ви отримуєте масив чисел, повертаєте суму всіх додатних.
# Приклад [1,-4,7,12]=>1 + 7 + 12 = 20
# Примітка: якщо підсумовувати нічого, сума за замовчуванням дорівнює 0.

# 10. Напишіть функцію min4(a, b, c, d), яка обчислює мінімум чотирьох чисел, яка не містить
# інструкції if, а використовує стандартну функцію min від двох чисел. Вважайте чотири цілих
# числа і виведіть їх мінімум.

'''

Складний рівень

'''

# 1. Дано чотири дійсні числа: x₁, y₁, x₂, y₂. Напишіть функцію distance(x1, y1, x2, y2), яка
# обчислює відстань між точками (x₁,y₁) та (x₂,y₂). Вважайте чотири дійсні числа і виведіть
# результат роботи цієї функції.

# 2. Напишіть функцію, яка обчислює довжину відрізка за координатами його кінців. За допомогою
# цієї функції напишіть програму, яка обчислює периметр трикутника за координатами трьох його вершин.
